loopgad/2025-e-sports_device/CubeMX Files References/PFC - Interleaved Boost G474inLQFP64.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.CommonPathInternal=null|null|null|null
ADC1.DMAContinuousRequests=DISABLE
ADC1.EOCSelection=ADC_EOC_SEQ_CONV
ADC1.EnableAnalogWatchDog1=false
ADC1.EnableInjectedConversion=ENABLE
ADC1.EnableRegularConversion=DISABLE
ADC1.ExternalTrigInjecConv=ADC_EXTERNALTRIGINJEC_HRTIM_TRG2
ADC1.IPParameters=EOCSelection,Overrun,DMAContinuousRequests,EnableRegularConversion,EnableInjectedConversion,InjectedRank-1\#ChannelInjectedConversion,InjectedChannel-1\#ChannelInjectedConversion,InjectedSamplingTime-1\#ChannelInjectedConversion,InjectedOffsetNumber-1\#ChannelInjectedConversion,InjectedRank-2\#ChannelInjectedConversion,InjectedChannel-2\#ChannelInjectedConversion,InjectedSamplingTime-2\#ChannelInjectedConversion,InjectedOffsetNumber-2\#ChannelInjectedConversion,InjectedRank-3\#ChannelInjectedConversion,InjectedChannel-3\#ChannelInjectedConversion,InjectedSamplingTime-3\#ChannelInjectedConversion,InjectedOffsetNumber-3\#ChannelInjectedConversion,InjNumberOfConversion,ExternalTrigInjecConv,EnableAnalogWatchDog1,InjectedRank-4\#ChannelInjectedConversion,InjectedChannel-4\#ChannelInjectedConversion,InjectedSamplingTime-4\#ChannelInjectedConversion,InjectedOffsetNumber-4\#ChannelInjectedConversion,master,Rank3_Channel,Rank4_Channel,Rank1_Channel,Rank2_Channel,CommonPathInternal
ADC1.InjNumberOfConversion=4
ADC1.InjectedChannel-1\#ChannelInjectedConversion=ADC_CHANNEL_2
ADC1.InjectedChannel-2\#ChannelInjectedConversion=ADC_CHANNEL_1
ADC1.InjectedChannel-3\#ChannelInjectedConversion=ADC_CHANNEL_3
ADC1.InjectedChannel-4\#ChannelInjectedConversion=ADC_CHANNEL_4
ADC1.InjectedOffsetNumber-1\#ChannelInjectedConversion=ADC_OFFSET_NONE
ADC1.InjectedOffsetNumber-2\#ChannelInjectedConversion=ADC_OFFSET_NONE
ADC1.InjectedOffsetNumber-3\#ChannelInjectedConversion=ADC_OFFSET_NONE
ADC1.InjectedOffsetNumber-4\#ChannelInjectedConversion=ADC_OFFSET_NONE
ADC1.InjectedRank-1\#ChannelInjectedConversion=1
ADC1.InjectedRank-2\#ChannelInjectedConversion=2
ADC1.InjectedRank-3\#ChannelInjectedConversion=3
ADC1.InjectedRank-4\#ChannelInjectedConversion=4
ADC1.InjectedSamplingTime-1\#ChannelInjectedConversion=ADC_SAMPLETIME_12CYCLES_5
ADC1.InjectedSamplingTime-2\#ChannelInjectedConversion=ADC_SAMPLETIME_24CYCLES_5
ADC1.InjectedSamplingTime-3\#ChannelInjectedConversion=ADC_SAMPLETIME_24CYCLES_5
ADC1.InjectedSamplingTime-4\#ChannelInjectedConversion=ADC_SAMPLETIME_24CYCLES_5
ADC1.Overrun=ADC_OVR_DATA_OVERWRITTEN
ADC1.Rank1_Channel=ADC_CHANNEL_2
ADC1.Rank2_Channel=ADC_CHANNEL_1
ADC1.Rank3_Channel=ADC_CHANNEL_3
ADC1.Rank4_Channel=ADC_CHANNEL_4
ADC1.master=1
ADC2.CommonPathInternal=null|null|null|null
ADC2.EOCSelection=ADC_EOC_SEQ_CONV
ADC2.EnableInjectedConversion=ENABLE
ADC2.EnableRegularConversion=DISABLE
ADC2.ExternalTrigInjecConv=ADC_EXTERNALTRIGINJEC_HRTIM_TRG4
ADC2.IPParameters=EOCSelection,EnableRegularConversion,EnableInjectedConversion,InjectedRank-1\#ChannelInjectedConversion,InjectedChannel-1\#ChannelInjectedConversion,InjectedSamplingTime-1\#ChannelInjectedConversion,InjectedOffsetNumber-1\#ChannelInjectedConversion,InjectedRank-2\#ChannelInjectedConversion,InjectedChannel-2\#ChannelInjectedConversion,InjectedSamplingTime-2\#ChannelInjectedConversion,InjectedOffsetNumber-2\#ChannelInjectedConversion,InjNumberOfConversion,ExternalTrigInjecConv,InjectedRank-3\#ChannelInjectedConversion,InjectedChannel-3\#ChannelInjectedConversion,Rank3_Channel,InjectedSamplingTime-3\#ChannelInjectedConversion,InjectedOffsetNumber-3\#ChannelInjectedConversion,InjectedRank-4\#ChannelInjectedConversion,InjectedChannel-4\#ChannelInjectedConversion,Rank4_Channel,InjectedSamplingTime-4\#ChannelInjectedConversion,InjectedOffsetNumber-4\#ChannelInjectedConversion,Rank2_Channel,Rank1_Channel,CommonPathInternal
ADC2.InjNumberOfConversion=4
ADC2.InjectedChannel-1\#ChannelInjectedConversion=ADC_CHANNEL_5
ADC2.InjectedChannel-2\#ChannelInjectedConversion=ADC_CHANNEL_5
ADC2.InjectedChannel-3\#ChannelInjectedConversion=ADC_CHANNEL_3
ADC2.InjectedChannel-4\#ChannelInjectedConversion=ADC_CHANNEL_12
ADC2.InjectedOffsetNumber-1\#ChannelInjectedConversion=ADC_OFFSET_NONE
ADC2.InjectedOffsetNumber-2\#ChannelInjectedConversion=ADC_OFFSET_NONE
ADC2.InjectedOffsetNumber-3\#ChannelInjectedConversion=ADC_OFFSET_NONE
ADC2.InjectedOffsetNumber-4\#ChannelInjectedConversion=ADC_OFFSET_NONE
ADC2.InjectedRank-1\#ChannelInjectedConversion=1
ADC2.InjectedRank-2\#ChannelInjectedConversion=2
ADC2.InjectedRank-3\#ChannelInjectedConversion=3
ADC2.InjectedRank-4\#ChannelInjectedConversion=4
ADC2.InjectedSamplingTime-1\#ChannelInjectedConversion=ADC_SAMPLETIME_12CYCLES_5
ADC2.InjectedSamplingTime-2\#ChannelInjectedConversion=ADC_SAMPLETIME_12CYCLES_5
ADC2.InjectedSamplingTime-3\#ChannelInjectedConversion=ADC_SAMPLETIME_24CYCLES_5
ADC2.InjectedSamplingTime-4\#ChannelInjectedConversion=ADC_SAMPLETIME_24CYCLES_5
ADC2.Rank1_Channel=ADC_CHANNEL_5
ADC2.Rank2_Channel=ADC_CHANNEL_5
ADC2.Rank3_Channel=ADC_CHANNEL_3
ADC2.Rank4_Channel=ADC_CHANNEL_12
CAD.formats=
CAD.pinconfig=
CAD.provider=
COMP2.BlankingSrce=COMP_BLANKINGSRC_NONE
COMP2.IPParameters=TriggerMode,BlankingSrce
COMP2.TriggerMode=COMP_TRIGGERMODE_IT_RISING
DAC1.DAC_Channel-DAC_OUT2_ExtAndInt=DAC_CHANNEL_2
DAC1.DAC_OutputBuffer-DAC_OUT1=DAC_OUTPUTBUFFER_DISABLE
DAC1.IPParameters=DAC_Channel-DAC_OUT2_ExtAndInt,DAC_OutputBuffer-DAC_OUT1
Dma.Request0=USART1_RX
Dma.RequestsNb=1
Dma.USART1_RX.0.Direction=DMA_PERIPH_TO_MEMORY
Dma.USART1_RX.0.EventEnable=DISABLE
Dma.USART1_RX.0.Instance=DMA1_Channel5
Dma.USART1_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART1_RX.0.MemInc=DMA_MINC_ENABLE
Dma.USART1_RX.0.Mode=DMA_CIRCULAR
Dma.USART1_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.USART1_RX.0.PeriphInc=DMA_PINC_DISABLE
Dma.USART1_RX.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART1_RX.0.Priority=DMA_PRIORITY_LOW
Dma.USART1_RX.0.RequestNumber=1
Dma.USART1_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.USART1_RX.0.SignalID=NONE
Dma.USART1_RX.0.SyncEnable=DISABLE
Dma.USART1_RX.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART1_RX.0.SyncRequestNumber=1
Dma.USART1_RX.0.SyncSignalID=NONE
File.Version=6
GPIO.groupedBy=Group By Peripherals
HRTIM1.ADCTrigger2_Source1=HRTIM_ADCTRIGGEREVENT24_TIMERA_CMP4
HRTIM1.ADCTrigger4_Source1=HRTIM_ADCTRIGGEREVENT24_TIMERB_CMP4
HRTIM1.ADCTrigger_Id1=__NULL
HRTIM1.ADCTrigger_Id2=HRTIM_ADCTRIGGER_2
HRTIM1.ADCTrigger_Id4=HRTIM_ADCTRIGGER_4
HRTIM1.CompareUnit1-MasterTimer=HRTIM_COMPAREUNIT_1
HRTIM1.CompareUnit1-Output_TA1=HRTIM_COMPAREUNIT_1
HRTIM1.CompareUnit1-Output_TB1=HRTIM_COMPAREUNIT_1
HRTIM1.CompareUnit2-Output_TA1=HRTIM_COMPAREUNIT_2
HRTIM1.CompareUnit2-Output_TB1=HRTIM_COMPAREUNIT_2
HRTIM1.CompareUnit3-Output_TA1=HRTIM_COMPAREUNIT_3
HRTIM1.CompareUnit3-Output_TB1=HRTIM_COMPAREUNIT_3
HRTIM1.CompareUnit4-Output_TA1=HRTIM_COMPAREUNIT_4
HRTIM1.CompareUnit4-Output_TB1=HRTIM_COMPAREUNIT_4
HRTIM1.CompareValue1-MasterTimer=HALF_HRTIM_PWM_PERIOD
HRTIM1.CompareValue1-Output_TA1=(uint16_t)(DUTY_CYCLE_MIN/2)
HRTIM1.CompareValue1-Output_TB1=(uint16_t)(DUTY_CYCLE_MIN/2)
HRTIM1.CompareValue2-Output_TA1=CS_BLANKING
HRTIM1.CompareValue2-Output_TB1=CS_BLANKING
HRTIM1.CompareValue3-Output_TA1=(uint16_t)(DUTY_CYCLE_MIN/2)+1
HRTIM1.CompareValue3-Output_TB1=(uint16_t)(DUTY_CYCLE_MIN/2)+1
HRTIM1.CompareValue4-Output_TA1=HALF_HRTIM_PWM_PERIOD+ADC_SAMPLE_DELAY
HRTIM1.CompareValue4-Output_TB1=HALF_HRTIM_PWM_PERIOD+ADC_SAMPLE_DELAY
HRTIM1.Enable_FaultLine1=HRTIM_FAULTMODECTL_DISABLED
HRTIM1.Event1-Output_TB1=HRTIM_EVENT_1
HRTIM1.Event2-Output_TA1=HRTIM_EVENT_2
HRTIM1.Event_EEV1=HRTIM_EVENT_1
HRTIM1.Event_EEV2=HRTIM_EVENT_2
HRTIM1.FaultEnable_Source1-Output_TA1=HRTIM_TIMFAULTENABLE_FAULT1
HRTIM1.FaultEnable_Source1-Output_TB1=HRTIM_TIMFAULTENABLE_FAULT1
HRTIM1.FaultLevel1-Output_TA1=HRTIM_OUTPUTFAULTLEVEL_INACTIVE
HRTIM1.FaultLevel1-Output_TB1=HRTIM_OUTPUTFAULTLEVEL_INACTIVE
HRTIM1.Fault_Line1=HRTIM_FAULT_1
HRTIM1.Filter1-Output_TB1=HRTIM_TIMEEVFLT_BLANKINGCMP2
HRTIM1.Filter2-Output_TA1=HRTIM_TIMEEVFLT_BLANKINGCMP2
HRTIM1.Filter_FaultLine1=HRTIM_FAULTFILTER_13
HRTIM1.HRTIMInterruptResquests1=HRTIM_IT_FLT1
HRTIM1.IPParameters=RepetitionCounter-MasterTimer,Periode_MASTER,PreloadEnable-MasterTimer,NumberInterruptRequests_Master-MasterTimer,Fault_Line1,Filter_FaultLine1,ADCTrigger_Id1,HRTIMInterruptResquests1,SyncOptions,SyncOutputPolarity,PrescalerRatio_MASTER,RepetitionUpdate-MasterTimer,CompareUnit1-MasterTimer,CompareValue1-MasterTimer,PrescalerRatio_TA,Periode_TA,ModeTimeBase-Output_TA1,PreloadEnable-Output_TA1,RepetitionUpdate-Output_TA1,NumberFaultEnable-Output_TA1,FaultEnable_Source1-Output_TA1,NumberResetTrigger-Output_TA1,ResetTrigger1-Output_TA1,NumberInterruptRequests-Output_TA1,CompareUnit4-Output_TA1,InterruptRequests1-Output_TA1,CompareUnit1-Output_TA1,CompareValue1-Output_TA1,CompareUnit2-Output_TA1,CompareValue2-Output_TA1,CompareUnit3-Output_TA1,CompareValue3-Output_TA1,CompareValue4-Output_TA1,NumberSetSource1-Output_TA1,NumberResetSource1-Output_TA1,Event_EEV1,Event_EEV2,Event2-Output_TA1,Filter2-Output_TA1,SetOutput1_Source1-Output_TA1,ResetOutput1_Source1-Output_TA1,ResetOutput1_Source2-Output_TA1,IdleMode1-Output_TA1,FaultLevel1-Output_TA1,Periode_TB,ModeTimeBase-Output_TB1,PrescalerRatio_TB,PreloadEnable-Output_TB1,NumberFaultEnable-Output_TB1,FaultEnable_Source1-Output_TB1,NumberResetTrigger-Output_TB1,ResetTrigger1-Output_TB1,NumberInterruptRequests-Output_TB1,CompareUnit1-Output_TB1,CompareUnit2-Output_TB1,CompareUnit3-Output_TB1,CompareUnit4-Output_TB1,InterruptRequests1-Output_TB1,CompareValue1-Output_TB1,CompareValue2-Output_TB1,CompareValue3-Output_TB1,CompareValue4-Output_TB1,Event1-Output_TB1,Filter1-Output_TB1,NumberSetSource1-Output_TB1,SetOutput1_Source1-Output_TB1,NumberResetSource1-Output_TB1,ResetOutput1_Source1-Output_TB1,ResetOutput1_Source2-Output_TB1,IdleMode1-Output_TB1,FaultLevel1-Output_TB1,PrescalerRatio_TC,Periode_TC,RepetitionCounter-No_output_TC,ModeTimeBase-No_output_TC,PreloadEnable-No_output_TC,RepetitionUpdate-No_output_TC,NumberResetTrigger-No_output_TC,ResetTrigger1-No_output_TC,NumberInterruptRequests-No_output_TC,InterruptRequests1-No_output_TC,Enable_FaultLine1,ADCTrigger_Id2,ORingUpdateSource_ADCTrigger2,NumberADCTriggerSource2,ADCTrigger2_Source1,ADCTrigger_Id4,ORingUpdateSource_ADCTrigger4,NumberADCTriggerSource4,ADCTrigger4_Source1,RepetitionUpdate-Output_TB1
HRTIM1.IPParametersWithoutCheck=CompareValue1-Output_TB1TB2,RisingValue-Output_TC1TC2,CompareValue2-Output_TB1,CompareValue4-Output_TA1,CompareValue3-Output_TB1,RepetitionCounter-No_output_TC,CompareValue2-Output_TD1TD2,CompareValue1-Output_TA1,CompareValue1-MasterTimer,CompareValue4-Output_TD1TD2,CompareValue2-Output_TA1TA2,CompareValue4-Output_TA1TA2,CompareValue1-Output_TD1TD2,CompareValue2-Output_TA1,CompareValue4-Output_TB1,Periode_TB,FallingValue-Output_TB1TB2,Periode_TA,CompareValue2-Output_TB1TB2,Periode_TC,CompareValue3-Output_TD1TD2,RepetitionCounter-MasterTimer,RisingValue-Output_TB1TB2,CompareValue3-Output_TA1,CompareValue3-Output_TA1TA2,CompareValue1-Output_TB1,CompareValue1-Output_TA1TA2,Periode_MASTER,FallingValue-Output_TC1TC2
HRTIM1.IdleMode1-Output_TA1=HRTIM_OUTPUTIDLEMODE_IDLE
HRTIM1.IdleMode1-Output_TB1=HRTIM_OUTPUTIDLEMODE_IDLE
HRTIM1.InterruptRequests1-No_output_TC=HRTIM_TIM_IT_REP
HRTIM1.InterruptRequests1-Output_TA1=HRTIM_TIM_IT_CMP4
HRTIM1.InterruptRequests1-Output_TB1=HRTIM_TIM_IT_CMP4
HRTIM1.ModeTimeBase-No_output_TC=HRTIM_MODE_SINGLESHOT_RETRIGGERABLE
HRTIM1.ModeTimeBase-Output_TA1=HRTIM_MODE_SINGLESHOT_RETRIGGERABLE
HRTIM1.ModeTimeBase-Output_TB1=HRTIM_MODE_SINGLESHOT_RETRIGGERABLE
HRTIM1.NumberADCTriggerSource2=1
HRTIM1.NumberADCTriggerSource4=1
HRTIM1.NumberFaultEnable-Output_TA1=1
HRTIM1.NumberFaultEnable-Output_TB1=1
HRTIM1.NumberInterruptRequests-No_output_TC=1
HRTIM1.NumberInterruptRequests-Output_TA1=1
HRTIM1.NumberInterruptRequests-Output_TB1=1
HRTIM1.NumberInterruptRequests_Master-MasterTimer=0
HRTIM1.NumberResetSource1-Output_TA1=2
HRTIM1.NumberResetSource1-Output_TB1=2
HRTIM1.NumberResetTrigger-No_output_TC=1
HRTIM1.NumberResetTrigger-Output_TA1=1
HRTIM1.NumberResetTrigger-Output_TB1=1
HRTIM1.NumberSetSource1-Output_TA1=1
HRTIM1.NumberSetSource1-Output_TB1=1
HRTIM1.ORingUpdateSource_ADCTrigger2=HRTIM_ADCTRIGGERUPDATE_TIMER_A
HRTIM1.ORingUpdateSource_ADCTrigger4=HRTIM_ADCTRIGGERUPDATE_TIMER_B
HRTIM1.Periode_MASTER=HRTIM_PWM_PERIOD
HRTIM1.Periode_TA=HRTIM_PWM_PERIOD
HRTIM1.Periode_TB=HRTIM_PWM_PERIOD
HRTIM1.Periode_TC=6000
HRTIM1.PreloadEnable-MasterTimer=HRTIM_PRELOAD_ENABLED
HRTIM1.PreloadEnable-No_output_TC=HRTIM_PRELOAD_ENABLED
HRTIM1.PreloadEnable-Output_TA1=HRTIM_PRELOAD_ENABLED
HRTIM1.PreloadEnable-Output_TB1=HRTIM_PRELOAD_ENABLED
HRTIM1.PrescalerRatio_MASTER=HRTIM_PRESCALERRATIO_MUL16
HRTIM1.PrescalerRatio_TA=HRTIM_PRESCALERRATIO_MUL16
HRTIM1.PrescalerRatio_TB=HRTIM_PRESCALERRATIO_MUL16
HRTIM1.PrescalerRatio_TC=HRTIM_PRESCALERRATIO_DIV4
HRTIM1.RepetitionCounter-MasterTimer=HRTIM_REP_RATE
HRTIM1.RepetitionCounter-No_output_TC=10
HRTIM1.RepetitionUpdate-MasterTimer=HRTIM_UPDATEONREPETITION_ENABLED
HRTIM1.RepetitionUpdate-No_output_TC=HRTIM_UPDATEONREPETITION_ENABLED
HRTIM1.RepetitionUpdate-Output_TA1=HRTIM_UPDATEONREPETITION_ENABLED
HRTIM1.RepetitionUpdate-Output_TB1=HRTIM_UPDATEONREPETITION_ENABLED
HRTIM1.ResetOutput1_Source1-Output_TA1=HRTIM_OUTPUTRESET_TIMCMP3
HRTIM1.ResetOutput1_Source1-Output_TB1=HRTIM_OUTPUTRESET_TIMCMP3
HRTIM1.ResetOutput1_Source2-Output_TA1=HRTIM_OUTPUTSET_EEV_2
HRTIM1.ResetOutput1_Source2-Output_TB1=HRTIM_OUTPUTRESET_EEV_1
HRTIM1.ResetTrigger1-No_output_TC=HRTIM_TIMRESETTRIGGER_MASTER_PER
HRTIM1.ResetTrigger1-Output_TA1=HRTIM_TIMRESETTRIGGER_MASTER_PER
HRTIM1.ResetTrigger1-Output_TB1=HRTIM_TIMRESETTRIGGER_MASTER_CMP1
HRTIM1.SetOutput1_Source1-Output_TA1=HRTIM_OUTPUTSET_TIMCMP1
HRTIM1.SetOutput1_Source1-Output_TB1=HRTIM_OUTPUTSET_TIMCMP1
HRTIM1.SyncOptions=HRTIM_SYNCOPTION_MASTER
HRTIM1.SyncOutputPolarity=HRTIM_SYNCOUTPUTPOLARITY_POSITIVE
KeepUserPlacement=false
Mcu.CPN=STM32G474RBT3
Mcu.Family=STM32G4
Mcu.IP0=ADC1
Mcu.IP1=ADC2
Mcu.IP10=SYS
Mcu.IP11=TIM16
Mcu.IP12=USART1
Mcu.IP2=COMP2
Mcu.IP3=COMP4
Mcu.IP4=COMP6
Mcu.IP5=DAC1
Mcu.IP6=DMA
Mcu.IP7=HRTIM1
Mcu.IP8=NVIC
Mcu.IP9=RCC
Mcu.IPNb=13
Mcu.Name=STM32G474R(B-C-E)Tx
Mcu.Package=LQFP64
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN
Mcu.Pin10=PA4
Mcu.Pin11=PA5
Mcu.Pin12=PA6
Mcu.Pin13=PA7
Mcu.Pin14=PC4
Mcu.Pin15=PB0
Mcu.Pin16=PB1
Mcu.Pin17=PB2
Mcu.Pin18=PB11
Mcu.Pin19=PB12
Mcu.Pin2=PC15-OSC32_OUT
Mcu.Pin20=PB13
Mcu.Pin21=PB15
Mcu.Pin22=PA8
Mcu.Pin23=PA9
Mcu.Pin24=PA10
Mcu.Pin25=PA11
Mcu.Pin26=PA13
Mcu.Pin27=PA14
Mcu.Pin28=PD2
Mcu.Pin29=PB3
Mcu.Pin3=PF0-OSC_IN
Mcu.Pin30=PB4
Mcu.Pin31=PB5
Mcu.Pin32=PB6
Mcu.Pin33=PB7
Mcu.Pin34=PB8-BOOT0
Mcu.Pin35=PB9
Mcu.Pin36=VP_COMP2_VS_VREFINT34
Mcu.Pin37=VP_COMP4_VS_VREFINT34
Mcu.Pin38=VP_COMP6_VS_VREFINT
Mcu.Pin39=VP_HRTIM1_VS_hrtimMasterTimerNoOutput
Mcu.Pin4=PF1-OSC_OUT
Mcu.Pin40=VP_HRTIM1_VS_hrtimTimerCNoOutput
Mcu.Pin41=VP_SYS_VS_Systick
Mcu.Pin42=VP_SYS_VS_DBSignals
Mcu.Pin43=VP_TIM16_VS_ClockSourceINT
Mcu.Pin44=VP_STMicroelectronics.X-CUBE-DPower_VS_LibraryJjDigitalIiPowerIiConverter_1.2.1_1.3.0
Mcu.Pin45=VP_STMicroelectronics.X-CUBE-DPower_VS_ACAaDCIiconverterJjinOoCCM_1.1.0_1.3.0
Mcu.Pin46=VP_STMicroelectronics.X-CUBE-DPower_VS_DeviceJjDSMPS_1.2.1_1.3.0
Mcu.Pin5=PC3
Mcu.Pin6=PA0
Mcu.Pin7=PA1
Mcu.Pin8=PA2
Mcu.Pin9=PA3
Mcu.PinsNb=47
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-DPower.1.3.0
Mcu.ThirdPartyNb=1
Mcu.UserConstants=
Mcu.UserName=STM32G474RBTx
MxCube.Version=6.12.0
MxDb.Version=DB.6.0.120
NVIC.BusFault_IRQn=true\:5\:0\:true\:false\:true\:false\:false\:false
NVIC.COMP1_2_3_IRQn=true\:5\:0\:true\:false\:true\:false\:true\:true
NVIC.DMA1_Channel5_IRQn=true\:5\:0\:true\:false\:true\:false\:true\:true
NVIC.DebugMonitor_IRQn=true\:5\:0\:true\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HRTIM1_FLT_IRQn=true\:0\:0\:false\:false\:false\:true\:false\:true
NVIC.HRTIM1_TIMA_IRQn=true\:1\:0\:true\:false\:false\:true\:false\:true
NVIC.HRTIM1_TIMB_IRQn=true\:1\:0\:true\:false\:false\:true\:false\:true
NVIC.HRTIM1_TIMC_IRQn=true\:4\:0\:true\:false\:false\:true\:false\:true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:5\:0\:true\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:5\:0\:true\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:5\:0\:true\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:2\:0\:true\:false\:false\:false\:false\:false
NVIC.TIM6_DAC_IRQn=true\:5\:0\:true\:false\:true\:true\:true\:true
NVIC.UsageFault_IRQn=true\:5\:0\:true\:false\:true\:false\:false\:false
PA0.GPIOParameters=GPIO_Label
PA0.GPIO_Label=ADCx_SHUNT_CURRENT_CHANNEL_PIN
PA0.Locked=true
PA0.Mode=IN1-Single-Ended
PA0.Signal=ADC1_IN1
PA1.GPIOParameters=GPIO_Label
PA1.GPIO_Label=ADCx_CT_CURRENT1_CHANNEL_PIN
PA1.Locked=true
PA1.Mode=IN2-Single-Ended
PA1.Signal=ADC1_IN2
PA10.GPIOParameters=GPIO_Label
PA10.GPIO_Label=PWM_LEG2_GPIO_PIN
PA10.Locked=true
PA10.Mode=Output_TB1
PA10.Signal=HRTIM1_CHB1
PA11.GPIOParameters=GPIO_Label
PA11.GPIO_Label=ENABLE_DRIVER_LEG2_GPIO_PIN
PA11.Locked=true
PA11.Signal=GPIO_Output
PA13.GPIOParameters=GPIO_Label
PA13.GPIO_Label=F.34 SWDO
PA13.Locked=true
PA13.Mode=Serial_Wire
PA13.Signal=SYS_JTMS-SWDIO
PA14.GPIOParameters=GPIO_Label
PA14.GPIO_Label=F.37 SWCLK
PA14.Locked=true
PA14.Mode=Serial_Wire
PA14.Signal=SYS_JTCK-SWCLK
PA2.GPIOParameters=GPIO_Label
PA2.GPIO_Label=ADCx_MAIN_VOLTAGE_CHANNEL_PIN
