loopgad/2025-e-sports_device/CubeMX Files References/PFC - Interleaved Boost G474inLQFP64.ioc
PA2.Locked=true
PA2.Mode=IN3-Single-Ended
PA2.Signal=ADC1_IN3
PA3.GPIOParameters=GPIO_Label
PA3.GPIO_Label=ADCx_RECT_VOLTAGE_CHANNEL_PIN
PA3.Locked=true
PA3.Mode=IN4-Single-Ended
PA3.Signal=ADC1_IN4
PA4.Locked=true
PA4.Signal=COMP_DAC11_group
PA5.Locked=true
PA5.Signal=COMP_DAC12_group
PA6.GPIOParameters=GPIO_Label
PA6.GPIO_Label=ADCy_VBUS_CHANNEL_PIN
PA6.Locked=true
PA6.Mode=IN3-Single-Ended
PA6.Signal=ADC2_IN3
PA7.GPIOParameters=GPIO_Label
PA7.GPIO_Label=COMP2_INP_CT2
PA7.Locked=true
PA7.Mode=INP
PA7.Signal=COMP2_INP
PA8.GPIOParameters=GPIO_Label
PA8.GPIO_Label=PWM_LEG1_GPIO_PIN
PA8.Locked=true
PA8.Mode=Output_TA1
PA8.Signal=HRTIM1_CHA1
PA9.GPIOParameters=GPIO_Label
PA9.GPIO_Label=ENABLE_DRIVER_LEG1_GPIO_PIN
PA9.Locked=true
PA9.Signal=GPIO_Output
PB0.GPIOParameters=GPIO_Label
PB0.GPIO_Label=COMP4_INP_CT1
PB0.Locked=true
PB0.Mode=INP
PB0.Signal=COMP4_INP
PB1.GPIOParameters=GPIO_Label
PB1.GPIO_Label=DEBUG_COMP4_OUT_GPIO_PIN
PB1.Locked=true
PB1.Mode=ExternalOutput
PB1.Signal=COMP4_OUT
PB11.GPIOParameters=GPIO_Label
PB11.GPIO_Label=COMP6_PIN_RSHUNT
PB11.Locked=true
PB11.Mode=INP
PB11.Signal=COMP6_INP
PB12.GPIOParameters=GPIO_Label
PB12.GPIO_Label=ADCz_VIPER_VOLTAGE_CHANNEL_PIN
PB12.Locked=true
PB12.Signal=ADC4_IN3
PB13.GPIOParameters=GPIO_Label
PB13.GPIO_Label=INRUSH_RELAY_GPIO_PIN
PB13.Locked=true
PB13.Signal=GPIO_Output
PB15.GPIOParameters=GPIO_Label
PB15.GPIO_Label=USER_LED_GPIO_PIN
PB15.Locked=true
PB15.Signal=GPIO_Output
PB2.GPIOParameters=GPIO_Label
PB2.GPIO_Label=ADCy_TEMP_CHANNEL_PIN
PB2.Locked=true
PB2.Mode=IN12-Single-Ended
PB2.Signal=ADC2_IN12
PB3.GPIOParameters=GPIO_Label
PB3.GPIO_Label=HRTIM_SCOUT_GPIO_PIN
PB3.Locked=true
PB3.Mode=SCOUTmode
PB3.Signal=HRTIM1_SCOUT
PB4.GPIOParameters=GPIO_Label
PB4.GPIO_Label=TIMx_SCIN_GPIO_PIN
PB4.Locked=true
PB4.Signal=S_TIM3_CH1
PB5.GPIOParameters=GPIO_Label
PB5.GPIO_Label=BLANKING_WINDOW2_TIM_GPIO_PIN
PB5.Locked=true
PB5.Signal=S_TIM3_CH2
PB6.GPIOParameters=GPIO_PuPd,GPIO_Label
PB6.GPIO_Label=F.43 RX
PB6.GPIO_PuPd=GPIO_PULLUP
PB6.Locked=true
PB6.Mode=Asynchronous
PB6.Signal=USART1_TX
PB7.GPIOParameters=GPIO_PuPd,GPIO_Label
PB7.GPIO_Label=F.42 TX
PB7.GPIO_PuPd=GPIO_PULLUP
PB7.Locked=true
PB7.Mode=Asynchronous
PB7.Signal=USART1_RX
PB8-BOOT0.GPIOParameters=GPIO_Label
PB8-BOOT0.GPIO_Label=F.45 SCL
PB8-BOOT0.Locked=true
PB8-BOOT0.Signal=I2C1_SCL
PB9.GPIOParameters=GPIO_Label
PB9.GPIO_Label=F.46 SDA
PB9.Locked=true
PB9.Signal=I2C1_SDA
PC13.GPIOParameters=GPIO_PuPd,GPIO_Label
PC13.GPIO_Label=GPIO_BOARD_POS
PC13.GPIO_PuPd=GPIO_PULLUP
PC13.Locked=true
PC13.Signal=GPIO_Input
PC14-OSC32_IN.GPIOParameters=GPIO_Label
PC14-OSC32_IN.GPIO_Label=DEBUG_DIGITAL_IDLE_OUT_GPIO_PIN
PC14-OSC32_IN.Locked=true
PC14-OSC32_IN.Signal=GPIO_Output
PC15-OSC32_OUT.GPIOParameters=GPIO_Label
PC15-OSC32_OUT.GPIO_Label=DEBUG_DIGITAL_OUT_GPIO_PIN
PC15-OSC32_OUT.Locked=true
PC15-OSC32_OUT.Signal=GPIO_Output
PC3.GPIOParameters=GPIO_Label
PC3.GPIO_Label=FAULT_LED
PC3.Locked=true
PC3.Signal=GPIO_Output
PC4.GPIOParameters=GPIO_Label
PC4.GPIO_Label=ADCz_CT_CURRENT2_CHANNEL_PIN
PC4.Mode=IN5-Single-Ended
PC4.Signal=ADC2_IN5
PD2.GPIOParameters=GPIO_Label
PD2.GPIO_Label=STATUS_LED
PD2.Locked=true
PD2.Signal=GPIO_Output
PF0-OSC_IN.Locked=true
PF0-OSC_IN.Mode=HSE-External-Oscillator
PF0-OSC_IN.Signal=RCC_OSC_IN
PF1-OSC_OUT.Locked=true
PF1-OSC_OUT.Mode=HSE-External-Oscillator
PF1-OSC_OUT.Signal=RCC_OSC_OUT
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32G474RBTx
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.6.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=false
ProjectManager.LibraryCopy=2
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=PFC - Interleaved Boost G474inLQFP64.ioc
ProjectManager.ProjectName=PFC - Interleaved Boost G474inLQFP64
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=EWARM V8.50
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_ADC2_Init-ADC2-false-HAL-true,6-MX_COMP2_Init-COMP2-false-HAL-true,7-MX_HRTIM1_Init-HRTIM1-false-HAL-true,8-MX_DAC1_Init-DAC1-false-HAL-true,9-MX_USART1_UART_Init-USART1-false-HAL-true,10-MX_COMP6_Init-COMP6-false-HAL-true,11-MX_COMP4_Init-COMP4-false-HAL-true,12-MX_TIM16_Init-TIM16-false-HAL-true,13-MX_X_CUBE_DPower_Init-STMicroelectronics.X-CUBE-DPower.1.3.0-false-HAL-false,14-MX_X_CUBE_DPower_Process-STMicroelectronics.X-CUBE-DPower.1.3.0-false-HAL-false
RCC.ADC12Freq_Value=170000000
RCC.ADC345Freq_Value=170000000
RCC.AHBFreq_Value=170000000
RCC.APB1Freq_Value=170000000
RCC.APB1TimFreq_Value=170000000
RCC.APB2Freq_Value=170000000
RCC.APB2TimFreq_Value=170000000
RCC.CRSFreq_Value=48000000
RCC.CortexFreq_Value=170000000
RCC.EXTERNAL_CLOCK_VALUE=12288000
RCC.FCLKCortexFreq_Value=170000000
RCC.FDCANFreq_Value=170000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=170000000
RCC.HRTIM1Freq_Value=170000000
RCC.HSE_VALUE=24000000
RCC.HSI48_VALUE=48000000
RCC.HSI_VALUE=16000000
RCC.I2C1Freq_Value=170000000
RCC.I2C2Freq_Value=170000000
RCC.I2C3Freq_Value=170000000
RCC.I2C4Freq_Value=170000000
RCC.I2SFreq_Value=170000000
RCC.IPParameters=ADC12Freq_Value,ADC345Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HRTIM1Freq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLM,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSourceVirtual,PWRFreq_Value,QSPIFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
RCC.LPTIM1Freq_Value=170000000
RCC.LPUART1Freq_Value=170000000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.MCO1PinFreq_Value=16000000
RCC.PLLM=RCC_PLLM_DIV6
RCC.PLLN=85
RCC.PLLPoutputFreq_Value=170000000
RCC.PLLQoutputFreq_Value=170000000
RCC.PLLRCLKFreq_Value=170000000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
RCC.PWRFreq_Value=170000000
RCC.QSPIFreq_Value=170000000
RCC.RNGFreq_Value=170000000
RCC.SAI1Freq_Value=170000000
RCC.SYSCLKFreq_VALUE=170000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.UART4Freq_Value=170000000
RCC.UART5Freq_Value=170000000
RCC.USART1Freq_Value=170000000
RCC.USART2Freq_Value=170000000
RCC.USART3Freq_Value=170000000
RCC.USBFreq_Value=170000000
RCC.VCOInputFreq_Value=4000000
RCC.VCOOutputFreq_Value=340000000
SH.COMP_DAC11_group.0=DAC1_OUT1,DAC_OUT1
SH.COMP_DAC11_group.ConfNb=1
SH.COMP_DAC12_group.0=DAC1_OUT2,DAC_OUT2_ExtAndInt
SH.COMP_DAC12_group.ConfNb=1
SH.S_TIM3_CH1.0=TIM3_CH1
SH.S_TIM3_CH1.ConfNb=1
SH.S_TIM3_CH2.0=TIM3_CH2
SH.S_TIM3_CH2.ConfNb=1
STMicroelectronics.X-CUBE-DPower.1.3.0.ACAaDCIiconverterJjinOoCCMJjInterleavedOoBoost=true
STMicroelectronics.X-CUBE-DPower.1.3.0.ACAaDCIiconverterJjinOoCCM_Checked=true
STMicroelectronics.X-CUBE-DPower.1.3.0.DSMPSCcDeviceJjApplication=PFC
STMicroelectronics.X-CUBE-DPower.1.3.0.DeviceJjDSMPS_Checked=true
STMicroelectronics.X-CUBE-DPower.1.3.0.G2=0.1885714285714285
STMicroelectronics.X-CUBE-DPower.1.3.0.G3=0.0036170212765957
STMicroelectronics.X-CUBE-DPower.1.3.0.G4=0.0066445182724252
STMicroelectronics.X-CUBE-DPower.1.3.0.GADC=1240.909090
STMicroelectronics.X-CUBE-DPower.1.3.0.HRTIM_CLOCK_HZ=2720000000
STMicroelectronics.X-CUBE-DPower.1.3.0.IPParameters=G2,G3,G4,GADC,Vin_Scaling,Vin_Offset,Vbus,Vbus_OVP,Vbus_UVP,VinRmsMinV,VinRmsMaxV,PinMaxW,SENSING_METHOD,SOFT_START_MS,OVERCURRENT_PROTECTION,SHORT_CIRCUIT_PROTECTION,OVERVOLTAGE_PROTECTION,OUT_VOLTAGE_BURST_MODE,SWITCHING_FREQ_HZ,HRTIM_CLOCK_HZ,LibraryJjDigitalIiPowerIiConverterJjPolesZerosControler,LibraryJjDigitalIiPowerIiConverterJjLegacy,ACAaDCIiconverterJjinOoCCMJjInterleavedOoBoost,DSMPSCcDeviceJjApplication
STMicroelectronics.X-CUBE-DPower.1.3.0.LibraryJjDigitalIiPowerIiConverterJjLegacy=true
STMicroelectronics.X-CUBE-DPower.1.3.0.LibraryJjDigitalIiPowerIiConverterJjPolesZerosControler=true
STMicroelectronics.X-CUBE-DPower.1.3.0.LibraryJjDigitalIiPowerIiConverter_Checked=true
STMicroelectronics.X-CUBE-DPower.1.3.0.OUT_VOLTAGE_BURST_MODE=false
STMicroelectronics.X-CUBE-DPower.1.3.0.OVERCURRENT_PROTECTION=false
STMicroelectronics.X-CUBE-DPower.1.3.0.OVERVOLTAGE_PROTECTION=false
STMicroelectronics.X-CUBE-DPower.1.3.0.PinMaxW=3000.0
STMicroelectronics.X-CUBE-DPower.1.3.0.SENSING_METHOD=2
STMicroelectronics.X-CUBE-DPower.1.3.0.SHORT_CIRCUIT_PROTECTION=false
STMicroelectronics.X-CUBE-DPower.1.3.0.SOFT_START_MS=3000
STMicroelectronics.X-CUBE-DPower.1.3.0.SWITCHING_FREQ_HZ=70000
STMicroelectronics.X-CUBE-DPower.1.3.0.Vbus=410.0
STMicroelectronics.X-CUBE-DPower.1.3.0.Vbus_OVP=450.0
STMicroelectronics.X-CUBE-DPower.1.3.0.Vbus_UVP=330.0
STMicroelectronics.X-CUBE-DPower.1.3.0.VinRmsMaxV=265.0
STMicroelectronics.X-CUBE-DPower.1.3.0.VinRmsMinV=50.0
STMicroelectronics.X-CUBE-DPower.1.3.0.Vin_Offset=2047.5
STMicroelectronics.X-CUBE-DPower.1.3.0.Vin_Scaling=0.0088079470198675
STMicroelectronics.X-CUBE-DPower.1.3.0_SwParameter=DSMPSCcDeviceJjApplication\:PFC;LibraryJjDigitalIiPowerIiConverterJjLegacy\:true;LibraryJjDigitalIiPowerIiConverterJjPolesZerosControler\:true;ACAaDCIiconverterJjinOoCCMJjInterleavedOoBoost\:true;
TIM16.IPParameters=PeriodNoDither
TIM16.IPParametersWithoutCheck=PeriodNoDither
TIM16.PeriodNoDither=((uint16_t) (SystemCoreClock / (uint32_t)(TEMPERATURE_FILTER_FREQ * (TEMPERATURE_FILTER_TIM_PRSC + 1))) -1)
USART1.IPParameters=VirtualMode-Asynchronous,TxPinLevelInvertParam,RxPinLevelInvertParam
USART1.IPParametersWithoutCheck=BaudRate
USART1.RxPinLevelInvertParam=ADVFEATURE_RXINV_DISABLE
USART1.TxPinLevelInvertParam=ADVFEATURE_TXINV_DISABLE
USART1.VirtualMode-Asynchronous=VM_ASYNC
VP_COMP2_VS_VREFINT34.Mode=VREFINT_34
VP_COMP2_VS_VREFINT34.Signal=COMP2_VS_VREFINT34
VP_COMP4_VS_VREFINT34.Mode=VREFINT_34
VP_COMP4_VS_VREFINT34.Signal=COMP4_VS_VREFINT34
VP_COMP6_VS_VREFINT.Mode=VREFINT
VP_COMP6_VS_VREFINT.Signal=COMP6_VS_VREFINT
VP_HRTIM1_VS_hrtimMasterTimerNoOutput.Mode=MasterTimer
VP_HRTIM1_VS_hrtimMasterTimerNoOutput.Signal=HRTIM1_VS_hrtimMasterTimerNoOutput
VP_HRTIM1_VS_hrtimTimerCNoOutput.Mode=No_output_TC
VP_HRTIM1_VS_hrtimTimerCNoOutput.Signal=HRTIM1_VS_hrtimTimerCNoOutput
VP_STMicroelectronics.X-CUBE-DPower_VS_ACAaDCIiconverterJjinOoCCM_1.1.0_1.3.0.Mode=ACAaDCIiconverterJjinOoCCM
VP_STMicroelectronics.X-CUBE-DPower_VS_ACAaDCIiconverterJjinOoCCM_1.1.0_1.3.0.Signal=STMicroelectronics.X-CUBE-DPower_VS_ACAaDCIiconverterJjinOoCCM_1.1.0_1.3.0
VP_STMicroelectronics.X-CUBE-DPower_VS_DeviceJjDSMPS_1.2.1_1.3.0.Mode=DeviceJjDSMPS
VP_STMicroelectronics.X-CUBE-DPower_VS_DeviceJjDSMPS_1.2.1_1.3.0.Signal=STMicroelectronics.X-CUBE-DPower_VS_DeviceJjDSMPS_1.2.1_1.3.0
VP_STMicroelectronics.X-CUBE-DPower_VS_LibraryJjDigitalIiPowerIiConverter_1.2.1_1.3.0.Mode=LibraryJjDigitalIiPowerIiConverter
VP_STMicroelectronics.X-CUBE-DPower_VS_LibraryJjDigitalIiPowerIiConverter_1.2.1_1.3.0.Signal=STMicroelectronics.X-CUBE-DPower_VS_LibraryJjDigitalIiPowerIiConverter_1.2.1_1.3.0
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
board=custom
